// Import necessary modules
import React, {useRef, useEffect} from 'react';
import {
  View,
  Image,
  Text,
  StyleSheet,
  Dimensions,
  Animated,
} from 'react-native';
import {GestureHandlerRootView, ScrollView} from 'react-native-gesture-handler';
import LinearGradient from 'react-native-linear-gradient';
import FontAwesome from 'react-native-vector-icons/FontAwesome';
import {rS, rMS, rV} from '../Components/responsive';
import {Colors} from '../constants/colors';
import {fadeIn} from '../constants/animations';

const baseWidth = 360;
const baseHeight = 640;
//height and width dec
const {width, height} = Dimensions.get('window');
const Item_width = width * 0.72;
const EMPTY_ITEM_SIZE = (width - Item_width) / 2;

const scaleWidth = height / baseWidth;
const scaleHeight = width / baseHeight;

const Note = () => {
  const fadeAnim = useRef(new Animated.Value(0)).current;

  useEffect(() => {
    fadeIn(fadeAnim, 300).start();
  }, []);

  return (
    <GestureHandlerRootView>
      <Animated.View style={[styles.container, {opacity: fadeAnim}]}>
        <ScrollView showsVerticalScrollIndicator={false}>
          <View>
            <Image style={styles.image} source={require('../Images/7.jpeg')} />
            <LinearGradient
              colors={['transparent', 'rgba(0,0,0,0.9)']}
              style={styles.gradient}>
              <Text
                style={{
                  position: 'absolute',
                  bottom: 10,
                  left: 10,
                  color: '#EEEEEE',
                  fontSize: rMS(23),
                  fontWeight: 'bold',
                  padding: rS(4),
                }}>
                About Srimad Bhagavatam
              </Text>
            </LinearGradient>
          </View>

          {/* <FontAwesome name='quote-left' size={rMS(37)} color={'#FF9130'} style={{marginHorizontal:rS(30),marginTop:rV(10)}}/>
        <Text style={{color:'#F57D1F',textAlign:'center',fontSize:rMS(18)}}>A Practical Guide To life</Text>
        <Text style={{color:'#F57D1F',textAlign:'center',fontSize:rMS(18)}}> Leading You towards ultimate joy</Text> */}
          <View style={{padding: scaleWidth * 3}}>
            <Text style={styles.text1}>आमुख </Text>
            <Text style={styles.text}>
              {' '}
              हमें मानव-समाज की वर्तमान आवश्यकता का ज्ञान अवश्य होना चाहिए। और
              यह आवश्यकता क्या है ? मानव समाज अब किसी देश विशेष या जाति विशेष की
              भौगोलिक सीमाओं से बँधा नहीं है । यह मध्ययुग की अपेक्षा अधिक व्यापक
              है और विश्व का झुकाव अब एक राज्य या एक मानव- समाज की सार्वभौम
              प्रवृत्ति की ओर जाता हुआ दिखता है। श्रीमद्भागवतम् के अनुसार
              आध्यात्मिक साम्यवाद के आदर्श समग्र मानव समाज पर, अथवा कहना चाहें
              तो, न्यूनाधिक जीवात्माओं की समग्र शक्ति पर आधारित हैं । महान्
              विचारक इसे सफल आदर्शवाद बनाने की आवश्यकता का अनुभव करते हैं।
              श्रीमद्भागवतम् द्वारा मानव समाज की इस आवश्यकता की पूर्ति हो सकेगी।
              अतः इसका शुभारम्भ वेदान्तदर्शन के सूत्र जन्माद्यस्य यत: से होता
              है, जिससे सामान्य हित के आदर्श की स्थापना हो सके।
            </Text>
            <Text style={styles.text}>
              इस समय मानव-समाज विस्मृति के अन्धकार में नहीं है । इसने समग्र
              विश्व में भौतिक सुविधाओं, शिक्षा तथा आर्थिक विकास के क्षेत्र में
              तेजी से प्रगति की है। किन्तु इस समाज के विराट् वपु में कहीं न कहीं
              कुछ चुभन है, जिससे छोटी-छोटी बातों पर भी व्यापक रूप से संघर्ष हो
              रहे हैं । अतः ऐसे दिशाबोध की आवश्यकता है, जिससे सामान्य हित के लिए
              मानवता शांति, मैत्री तथा समृद्धि के क्षेत्रों में एक हो सके।
              श्रीमद्भागवतम् से इस आवश्यकता की पूर्ति होगी, क्योंकि यह समग्र
              मानव-समाज के पुनः आध्यात्मीकरण हेतु एक सांस्कृतिक भेंट है ।
            </Text>
            <Text style={styles.text}>
              श्रीमद्भागवतम् का पठन-पाठन विद्यालयों तथा महाविद्यालयों में भी
              होना चाहिए, क्योंकि महान् छात्र- भक्त प्रह्लाद महाराज ने समाज के
              आसुरी स्वरूप को बदलने हेतु श्रीमद्भागवतम् (७.६.१) में इसकी
              संस्तुति की है:
            </Text>
            <Text style={styles.textverse}>
              कौमार आचरेत्प्राज्ञो धर्मान् भागवतानिह ।{' '}
            </Text>
            <Text style={styles.textverse}>
              दुर्लभं मानुषं जन्म तदप्यध्रुवमर्थदम् ॥
            </Text>
            <Text style={styles.text}>
              मानव-समाज में जो विषमता व्याप्त है, उसका मूल कारण ईश्वर-विहीन
              सभ्यता में सिद्धान्तों का अभाव है। परमेश्वर अर्थात् सर्वशक्तिमान
              विद्यमान हैं, जिनसे प्रत्येक वस्तु का उद्भव होता है, जिनके द्वारा
              सबका पालन होता है और जिनमें विश्रांति हेतु सबका विलय होता है।
              भौतिक विज्ञान ने सृष्टि के परम स्रोत के अन्वेषण (खोज) हेतु जो
              प्रयास किये हैं, वे अपर्याप्त हैं; किन्तु तथ्य यही है कि जो भी
              अस्तित्व में है, उस प्रत्येक वस्तु का एक परम स्रोत है । और इस परम
              स्रोत की व्याख्या सुन्दर श्रीमद्भागवतम् में तर्कयुक्त एवं
              प्रामाणिक रूप से की गई है।
            </Text>
            <Text style={styles.text}>
              श्रीमद्भागवतम् न केवल प्रत्येक वस्तु के परम स्रोत को जानने हेतु
              दिव्य विज्ञान है, अपितु ईश्वर से अपने सम्बन्ध को जानने और इस
              पूर्णज्ञान के आधार पर मानव-समाज की पूर्णता के प्रति अपने कर्तव्य
              को पहचानने का दिव्य विज्ञान है। यह संस्कृत भाषा में ओजपूर्ण पठनीय
              सामग्री है, जिसका अब संस्कृत से हिंदी में विस्तृत अनुवाद किया गया
              है, जिससे लोग इसके सतर्क पठन मात्र से ईश्वर को भली-भाँति समझ
              सकेंगे। यही नहीं, इसका पाठक नास्तिकों द्वारा किये जाने वाले
              प्रहारों से अपनी रक्षा करने हेतु पर्याप्त शिक्षित भी बन सकेगा।
              इसके अतिरिक्त, पाठक दूसरों को भी सुनिश्चित सिद्धान्त के रूप में
              ईश्वर को स्वीकार कराने में सक्षम हो सकेगा।
            </Text>
            <Text style={styles.text}>
              श्रीमद्भागवतम् का शुभारम्भ परम स्रोत की परिभाषा से होता है। यह
              श्रील व्यासदेव द्वारा रचे वेदान्तसूत्र पर उन्हीं का प्रामाणिक
              भाष्य है, जो क्रमशः नौ स्कन्धों में विकसित होकर भगवत्-साक्षात्कार
              की सर्वोच्च अवस्था तक पहुँचता है। दिव्य ज्ञान की इस महान् कृति के
              अध्ययन हेतु मनुष्य में जिस एकमात्र योग्यता की आवश्यकता है, वह है
              सावधानी के साथ एक-एक पग आगे बढ़ा जाए और किसी साधारण पुस्तक के समान
              पढ़ने में कूद- फाँद न मचाई जाए, अपितु इसके अध्यायों को क्रमपूर्वक
              एक-एक करके पढ़ा जाए। सम्पूर्ण पाठ इस प्रकार व्यवस्थित किया गया है
              कि प्रथम मूल संस्कृत पाठ, फिर संस्कृत शब्दों के पर्याय और तब
              अनुवाद तथा तात्पर्य दिये गए हैं, जिससे कि जब कोई प्रथम नौ स्कन्धों
              को समाप्त कर ले, तो उसे निश्चय ही भगवत्-साक्षात्कार हो पाए।
            </Text>
            <Text style={styles.text}>
              इसका दसवाँ स्कन्ध प्रथम नौ स्कन्धों से भिन्न है, क्योंकि इसका सीधा
              सम्बन्ध भगवान् श्रीकृष्ण की दिव्य लीलाओं से है। जब तक प्रथम नौ
              स्कन्धों को पढ़ नहीं लिया जाता, तब तक दसवें स्कन्ध के प्रभावों को
              ग्रहण नहीं किया जा सकता। यह ग्रन्थ बारह स्कन्धों में पूरा हुआ है।
              इनमें से प्रत्येक स्कन्ध अपने आप में स्वतन्त्र है; किन्तु सबके लिए
              उत्तम होगा कि वे क्रमशः एक के बाद दूसरे स्कन्ध को छोटे-छोटे
              टुकड़ों में पढ़ें।
            </Text>
            <Text style={styles.text}>
              श्रीमद्भागवतम् को प्रस्तुत करते हुए मैं अपनी न्यूनताओं को स्वीकार
              करता हूँ; किन्तु फिर भी मुझे विश्वास है कि श्रीमद्भागवतम् (१.५.११)
              के निम्नलिखित कथन के आधार पर विचारक तथा समाज के नायक इसका सम्यक्
              स्वागत करेंगे :{' '}
            </Text>
            <Text style={styles.textverse}>तद्वाग्विसर्गो जनताघविप्लवो</Text>
            <Text style={styles.textverse}>
              यस्मिन् प्रतिश्लोकमबद्धवत्यपि ।
            </Text>
            <Text style={styles.textverse}>
              नामान्यनन्तस्य यशोऽङ्कितानि यत्
            </Text>
            <Text style={styles.textverse}>
              शृण्वन्ति गायन्ति गृणन्ति साधवः ॥{' '}
            </Text>
            <Text style={styles.text}>
              इसके विपरीत, वह साहित्य, जो अनन्त श्रीभगवान् के नाम, यश, रूप तथा
              लीलाओं की दिव्य महिमाओं के वर्णनों से परिपूर्ण है; एक दिव्य रचना
              है, जो इस विश्व की भ्रमित की गई सभ्यता के अपवित्र जीवन में
              क्रान्ति लाने के उद्देश्य से रची गई है। ऐसा दिव्य साहित्य भले ही
              अनियमित रूप से प्रणीत हो; किन्तु उसे पवित्र एवं धर्मनिष्ठ साधुजनों
              के द्वारा सुना, गाया और स्वीकार किया जाता है।
            </Text>
            <Text style={styles.text1}>प्रस्तावना</Text>
            <Text style={styles.text2}>
              " यह श्रीमद्भागवत् पुराण सूर्य के समान तेजस्वी है और धर्म, ज्ञान
              आदि के साथ श्रीकृष्ण द्वारा अपने धाम चले जाने के उपरांत इसका उदय
              हुआ । जिन मनुष्यों ने कलियुग में अज्ञान के गहन अन्धकार के कारण
              अपनी दृष्टि खो दी है, उन्हें इस पुराण से प्रकाश प्राप्त होगा। " (
              श्रीमद्भागवतम् १.३.४३)
            </Text>
            <Text style={styles.text2}>
              भारत का कालातीत ज्ञान प्राचीन संस्कृत ग्रन्थों अर्थात् वेदों में
              व्यक्त हुआ है, जो मानव ज्ञान के समस्त क्षेत्रों को स्पर्श करने
              वाला है । प्रारम्भ में इसका संरक्षण मौखिक परम्परा द्वारा होता रहा,
              किन्तु पाँच हजार वर्ष पूर्व सर्वप्रथम “ श्रीभगवान् के साहित्यिक
              अवतार" श्रील व्यासदेव ने वेदों को लिखित रूप प्रदान किया। वेदों के
              संकलन के पश्चात् उन्होंने उनके सारांश को वेदान्तसूत्र के रूप में
              प्रस्तुत किया। श्रीमद्भागवतम् (श्रीमद्भागवत् पुराण) स्वयं श्रील
              व्यासदेव द्वारा विरचित उनके वेदान्तसूत्र का भाष्य है । इसकी रचना
              उन्होंने अपने आध्यात्मिक जीवन की परिपक्व अवस्था में अपने गुरु
              श्रीनारदमुनि के निर्देशन में की थी । "वैदिक वाङ्मय रूपी वृक्ष का
              परिपक्व फल" कहा जाने वाला यह श्रीमद्भागवतम् वैदिक ज्ञान का
              सर्वाधिक पूर्ण एवं प्रामाणिक भाष्य है।
            </Text>
            <Text style={styles.text2}>
              श्रीमद्भागवतम् की रचना कर लेने के पश्चात् श्रील व्यासदेव ने अपने
              पुत्र मुनि श्री शुकदेव गोस्वामी को इसका सार भाग हृदयंगम कराया ।
              तत्पश्चात् श्रील शुकदेव गोस्वामी ने हस्तिनापुर (अब दिल्ली) में
              गंगातट पर विद्वान् मुनियों की एक सभा में महाराज परीक्षित को
              सम्पूर्ण श्रीमद्भागवतम् सुनाया। महाराज परीक्षित सम्पूर्ण संसार के
              चक्रवर्ती सम्राट और एक राजर्षि थे। उन्हें जब सचेत किया गया कि एक
              सप्ताह में उनकी मृत्यु हो जाएगी, तो उन्होंने अपना सम्पूर्ण
              साम्राज्य त्याग दिया और आमरण उपवास करने तथा आध्यात्मिक ज्ञान की
              प्राप्ति करने हेतु गंगा नदी के तट पर चले गए। श्रीमद्भागवतम् का
              शुभारम्भ सम्राट परीक्षित द्वारा श्रील शुकदेव गोस्वामी से पूछे इस
              गम्भीर प्रश्न से प्रारम्भ होता है : " आप महान् सन्तों तथा भक्तों
              के गुरु हैं । अतः मैं आपसे समस्त मनुष्यों के लिए और विशेष रूप से
              मरणासन्न मनुष्य के लिए पूर्णता का मार्ग दिखलाने की याचना करता हूँ
              । कृपया मुझे बताएँ कि मनुष्य के लिए श्रवण, कीर्तन, स्मरण और आराधन
              का विषय क्या होना चाहिए और उसे क्या नहीं करना चाहिए ? कृपया मुझे
              यह सब समझाइये ।{' '}
            </Text>
            <Text style={styles.text2}>
              महाराज परीक्षित द्वारा पूछे गए इस प्रश्न तथा अनेकानेक प्रश्न, जो
              आत्मा की प्रकृति से लेकर ब्रह्माण्ड की उत्पत्ति के विषय तक से
              सम्बन्ध रखते हैं, उनका श्रील शुकदेव गोस्वामी ने जो उत्तर दिया, उसे
              ऋषियों की सभा राजा की मृत्युपर्यन्त सात दिनों तक मन्त्रमुग्ध होकर
              सुनती रही। जब श्रील शुकदेव गोस्वामी ने श्रीमद्भागवतम् की कथा को
              प्रथम बार सुनाया, तब श्रील सूत गोस्वामी, जो वहीं उपस्थित थे;
              उन्होंने नैमिषारण्य के वन में ऋषियों की एक सभा में उसी कथा को पुनः
              सुनाया। जनसाधारण के आध्यात्मिक कल्याण की इच्छा से ये सभी ऋषिगण
              आरम्भ होने वाले कलियुग के दुष्प्रभावों के निवारण हेतु दीर्घकालीन
              यज्ञ-सत्रों का अनुष्ठान करने के लिए एकत्र हुए थे। जब इन ऋषियों ने
              प्रार्थना की कि श्रील सूत गोस्वामी वैदिक ज्ञान का सार कह सुनाएँ,
              तो उन्होंने अपनी स्मृति से श्रीमद्भागवतम् के सभी अठारह हजार श्लोक
              सुना दिये, जिन्हें श्रील शुकदेव गोस्वामी ने महाराज परीक्षित को
              सुनाया था।
            </Text>
            <Text style={styles.text2}>
              श्रीमद्भागवतम् का पाठक वस्तुतः महाराज परीक्षित द्वारा पूछे गए
              प्रश्नों के श्रील शुकदेव गोस्वामी द्वारा दिये गए उत्तर श्रील सूत
              गोस्वामी के मुख से सुनता है। कहीं-कहीं श्रील सूत गोस्वामी
              नैमिषारण्य में एकत्र साधुओं के प्रतिनिधि, शौनक ऋषि द्वारा पूछे गए
              प्रश्नों के सीधे उत्तर देते हैं। इस प्रकार एक साथ दो प्रकार के
              संवाद सुनने को मिलते हैं - एक गंगातट पर महाराज परीक्षित तथा श्रील
              शुकदेव गोस्वामी के बीच और दूसरा नैमिषारण्य में श्रील सूत गोस्वामी
              तथा वहाँ एकत्रित साधुओं के प्रतिनिधि, शौनक ऋषि के बीच हुए संवाद।
              यही नहीं, बीच-बीच में श्रील शुकदेव गोस्वामी महाराज परीक्षित को
              उपदेश देते हुए ऐतिहासिक घटनाओं का भी वर्णन करते जाते हैं। वे उन
              विस्तृत दार्शनिक चर्चाओं का विवरण भी प्रस्तुत करते हैं, जो
              श्रीमैत्रेयमुनि तथा उनके शिष्य विदुर जैसे महात्माओं के बीच हुईं।
              श्रीमद्भागवतम् की इस ऐतिहासिक पृष्ठभूमि को समझ लेने पर पाठक इसमें
              आये हुए संवादों के मिश्रण तथा विभिन्न स्रोतों से आयी हुई घटनाओं को
              सरलता से समझ लेगा। चूँकि मूल पाठ में दार्शनिक साहित्य या ज्ञान ही
              महत्त्वपूर्ण है, कालक्रमिकता नहीं, अतः केवल श्रीमद्भागवतम् की
              विषयवस्तु के प्रति ही सचेष्ट रहने की आवश्यकता है, जिससे इसके गहन
              संदेश का रसास्वादन पूर्णतया किया जा सके।
            </Text>
            <Text style={styles.text2}>
              इस संस्करण के अनुवादक (श्रील प्रभुपाद ) ने श्रीमद्भागवतम् की तुलना
              मिश्री से की है— चाहे जहाँ से इसका रसास्वादन करें, सर्वत्र समान
              मिठास और स्वाद मिलेगा। अतएव श्रीमद्भागवतम् की मधुरता का रसास्वादन
              करने हेतु किसी भी भाग से पढ़ना शुरू किया जा सकता है। इस प्रारम्भिक
              रसास्वादन के पश्चात् गम्भीर पाठक को यह परामर्श दिया जाता है कि वह
              पुनः प्रथम स्कन्ध पर लौटे और तब श्रीमद्भागवतम् के विभिन्न स्कन्धों
              को उचित क्रमानुसार एक के उपरांत दूसरे स्कन्ध को पढ़े।
            </Text>
            <Text style={styles.text2}>
              श्रीमद्भागवतम् का पहला संस्करण इस महत्त्वपूर्ण ग्रन्थ का विस्तृत
              भाष्य सहित प्रथम पूर्ण अंग्रेजी अनुवाद था और इसे अंग्रेजी भाषी
              जनता को व्यापक तौर पर उपलब्ध प्रथम संस्करण माना जाता है। पहले
              स्कन्ध से दसवें स्कन्ध के प्रथम भाग तक के प्रथम बारह खण्ड भारतीय
              धर्म तथा दर्शन के विश्व के सर्वाधिक प्रसिद्ध उपदेशक तथा
              अन्तर्राष्ट्रीय कृष्णभावनामृत संघ के संस्थापकाचार्य
              कृष्णकृपामूर्ति श्री श्रीमद् ए. सी. भक्तिवेदान्त स्वामी प्रभुपाद
              की विद्वत्ता एवं भक्तिमय प्रयास का परिणाम है। उनके उत्कृष्ट
              संस्कृत - पाण्डित्य और वैदिक संस्कृति तथा आधुनिक जीवन-पद्धति से
              घनिष्ठ परिचय के फलस्वरूप इस महत्त्वपूर्ण वरेण्य साहित्य का भव्य
              भाष्य प्रस्तुत किया जा रहा है। १९७७ में इस संसार से श्रील प्रभुपाद
              के तिरोधान के पश्चात्, श्रीमद्भागवतम् के अनुवाद एवं टीका का भगीरथ
              कार्य उनके शिष्यों हृदयानन्द दास गोस्वामी और गोपीपराणधन दास द्वारा
              जारी रखा गया है।
            </Text>
            <Text style={styles.text2}>
              पाठकों को यह कृति अनेक कारणों से महत्त्वपूर्ण लगेगी। जो मनुष्य
              भारतीय सभ्यता के सांस्कृतिक मूल में रुचि रखते हैं, उनके लिए यह
              लगभग प्रत्येक पक्ष पर विस्तृत जानकारी देने वाला व्यापक स्रोत है ।
              तुलनात्मक दर्शन तथा धर्म के विद्यार्थियों के लिए श्रीमद्भागवतम्
              भारतीय महान् सांस्कृतिक धरोहर के अर्थ को समझने में तीक्ष्ण दृष्टि
              प्रदान करने वाला है । समाजविज्ञानियों तथा तत्त्वशास्त्रियों के लिए
              श्रीमद्भागवतम् शांत एवं वैज्ञानिक ढंग से सुनियोजि वैदिक संस्कृति
              की व्यावहारिक कार्यपद्धति को प्रकट करने वाला है, जिसके सिद्धान्तों
              का एकीकरण अत्यन्त विकसित सार्वभौम आध्यात्मिक दृष्टिकोण के आधार पर
              हुआ था । साहित्य के अध्येताओं को श्रीमद्भागवतम् उत्कृष्ट काव्य की
              सर्वश्रेष्ठ कृति प्रतीत होगा । मनोविज्ञान के अध्येताओं को यह
              चेतना, मानव-आचरण तथा आत्मस्वरूप के दार्शनिक अध्ययन के लिए
              महत्त्वपूर्ण दृष्टिकोण प्रदान करता है। अंत में, जो आध्यात्मिक
              अंतर्दृष्टि की खोज करने वाले हैं, उनके लिए श्रीमद्भागवतम् एक सरल
              एवं व्यावहारिक पथ-प्रदर्शक का काम करेगा, जो सर्वोच्च आत्मज्ञान तथा
              परम सत्य का साक्षात्कार कराएगा भक्तिवेदान्त बुक ट्रस्ट द्वारा
              प्रस्तुत किया गया अनेक खण्डों में उपलब्ध यह सम्पूर्ण ग्रन्थ आने
              वाले दीर्घकाल तक आधुनिक मानव के बौद्धिक, सांस्कृतिक तथा आध्यात्मिक
              जीवन में महत्त्वपूर्ण स्थान बनाए रखेगा।{' '}
            </Text>
          </View>
        </ScrollView>
      </Animated.View>
    </GestureHandlerRootView>
  );
};

// Style your components
const styles = StyleSheet.create({
  container: {
    flex: 1,
    backgroundColor: Colors.background,
  },
  image: {
    width: width * 1,
    height: height / 2.6,
    borderBottomLeftRadius: 20,
    borderBottomRightRadius: 20,
    marginBottom: rV(5),
  },
  text: {
    fontSize: rMS(14),
    textAlign: 'left',
    margin: rS(9),
    color: Colors.textPrimary,
    marginTop: rV(15),
    lineHeight: rMS(22),
  },
  gradient: {
    position: 'absolute',
    left: 0,
    right: 0,
    bottom: 0,
    height: '50%',
    justifyContent: 'center',
    alignItems: 'center',
    borderRadius: 16,
  },
  text1: {
    textAlign: 'center',
    color: Colors.textPrimary,
    fontSize: rMS(24),
    fontWeight: '600',
    marginTop: rV(20),
    marginBottom: rV(10),
    letterSpacing: 0.5,
  },
  text2: {
    textAlign: 'left',
    color: Colors.textPrimary,
    fontSize: rMS(14),
    margin: rS(9),
    lineHeight: rMS(22),
  },
  textverse: {
    fontSize: rMS(16),
    textAlign: 'center',
    margin: rS(1.5),
    color: Colors.primary,
    fontWeight: '500',
    lineHeight: rMS(24),
  },
});

// Export your component
export default Note;
